openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_rcc.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32x3x5_rcc.c
* Author             : WCH
* Version            : V1.0.1
* Date               : 2026/08/21
* Description        : This file provides all the RCC firmware functions.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32x3x5_rcc.h"

/* RCC registers bit mask */
/* CTLR register bit mask */
#define CTLR_HSEBYP_Reset          ((uint32_t)0xFFFBFFFF)
#define CTLR_HSEBYP_Set            ((uint32_t)0x00040000)
#define CTLR_HSEON_Reset           ((uint32_t)0xFFFEFFFF)
#define CTLR_HSEON_Set             ((uint32_t)0x00010000)
#define CTLR_HSITRIM_Mask          ((uint32_t)0xFFFFFF07)
#define CTLR_LPM_Mask              ((uint32_t)0xFFFFFF7F)

#define CFGR0_SWS_Mask             ((uint32_t)0x0000000C)
#define CFGR0_SW_Mask              ((uint32_t)0xFFFFFFFC)
#define CFGR0_HPRE_Reset_Mask      ((uint32_t)0xFFFFFF0F)
#define CFGR0_PPRE2_Reset_Mask     ((uint32_t)0xFFFFC7FF)
#define CFGR0_ADCPRE_Reset_Mask    ((uint32_t)0xFFFF3FFF)
#define CFGR0_HPRE_Set_Mask        ((uint32_t)0x000000F0)
#define CFGR0_FPRE_Set_Mask        ((uint32_t)0x00000100) 
#define CFGR0_PPRE2_Set_Mask       ((uint32_t)0x00003800) 
#define CFGR0_ADCPRE_Set_Mask      ((uint32_t)0x0000C000) 

/* RSTSCKR register bit mask */
#define RSTSCKR_RMVF_Set           ((uint32_t)0x01000000)

/* CFGR2 register bit mask */
#define CFGR2_ADCPRE_Reset_Mask    ((uint32_t)0xF0000000)
#define CFGR2_ADCSRC_Set_Mask      ((uint32_t)0x01000000) 
#define CFGR2_ADCPLLSRC_Set_Mask   ((uint32_t)0x08000000) 
#define CFGR2_ADCCLKDIV_Set_Mask   ((uint32_t)0xF0000000)

/* RCC Flag Mask */
#define FLAG_Mask                  ((uint8_t)0x1F)

/* INTR register byte 2 (Bits[15:8]) base address */
#define INTR_BYTE2_ADDRESS         ((uint32_t)0x40021009)

/* INTR register byte 3 (Bits[23:16]) base address */
#define INTR_BYTE3_ADDRESS         ((uint32_t)0x4002100A)

/* CFGR0 register byte 4 (Bits[31:24]) base address */
#define CFGR0_BYTE4_ADDRESS        ((uint32_t)0x40021007)

#define PLLHS_SRC_Mask             ((uint32_t)0x30000000)
#define PLLDIV_Mask                ((uint32_t)0x1E0000)

static __I uint8_t PLLDIV[16] = {6, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16};
static __I uint8_t ADCCLKDIV[16] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16};
static __I uint8_t HPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
static __I uint8_t ADCPrescTable[4] = {2, 4, 6, 8};
static __I uint8_t PPrescTable[8] = {1, 1, 1, 1, 2, 4, 8, 16};

/*********************************************************************
 * @fn      RCC_DeInit
 *
 * @brief   Resets the RCC clock configuration to the default reset state.
 *          Note-
 *          HSE can not be stopped if it is used directly or through the PLL as system clock.
 * @return  none
 */
void RCC_DeInit(void)
{
    RCC->CTLR |= (uint32_t)0x00000001;    
    while ((RCC->CTLR & (uint32_t)RCC_HSIRDY) != (uint32_t)RCC_HSIRDY)
    {
    }
    RCC->CFGR0 &= (uint32_t)0xFFFFFFFC;
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x00)
    {
    }
    RCC->CFGR0 &= (uint32_t)0x00000003;
    RCC->CTLR &= (uint32_t)0x7FFEFFFF;
    RCC->CTLR &= (uint32_t)0xEAF3FEFF;

    RCC->INTR = 0x008D0000;
    RCC->CFGR2 &= 0x00C0FC00;
    RCC->CFGR2 |= 0x10000000;
}

/*********************************************************************
 * @fn      RCC_HSEConfig
 *
 * @brief   Configures the External High Speed oscillator (HSE).
 *
 * @param   RCC_HSE -
 *            RCC_HSE_OFF - HSE oscillator OFF.
 *            RCC_HSE_ON - HSE oscillator ON.
 *            RCC_HSE_Bypass - HSE oscillator bypassed with external clock.
 *          Note-
 *            HSE can not be stopped if it is used directly or through the PLL as system clock.
 * @return  none
 */
void RCC_HSEConfig(uint32_t RCC_HSE)
{
    RCC->CTLR &= CTLR_HSEON_Reset;
    RCC->CTLR &= CTLR_HSEBYP_Reset;

    switch(RCC_HSE)
    {
        case RCC_HSE_ON:
            RCC->CTLR |= CTLR_HSEON_Set;
            break;

        case RCC_HSE_Bypass:
            RCC->CTLR |= CTLR_HSEBYP_Set | CTLR_HSEON_Set;
            break;

        default:
            break;
    }
}

/*********************************************************************
 * @fn      RCC_WaitForHSEStartUp
 *
 * @brief   Waits for HSE start-up.
 *
 * @return  READY - HSE oscillator is stable and ready to use.
 *          NoREADY - HSE oscillator not yet ready.
 */
ErrorStatus RCC_WaitForHSEStartUp(void)
{
    __IO uint32_t StartUpCounter = 0;

    ErrorStatus status = NoREADY;
    FlagStatus  HSEStatus = RESET;

    do
    {
        HSEStatus = RCC_GetFlagStatus(RCC_FLAG_HSERDY);
        StartUpCounter++;
    } while((StartUpCounter != HSE_STARTUP_TIMEOUT) && (HSEStatus == RESET));

    if(RCC_GetFlagStatus(RCC_FLAG_HSERDY) != RESET)
    {
        status = READY;
    }
    else
    {
        status = NoREADY;
    }

    return (status);
}

/*********************************************************************
 * @fn      RCC_HSICmd
 *
 * @brief   Enables or disables the Internal High Speed oscillator (HSI).
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HSICmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= (1 << 0);
    }
    else
    {
        RCC->CTLR &= ~(1 << 0);
    }
}

/*********************************************************************
 * @fn      RCC_PLLConfig
 *
 * @brief   Configures the PLL clock source and divider factor.
 *
 * @param   RCC_PLLSource - specifies the PLL entry clock source.
 *            RCC_PLLSource_USBHS(480M) - USBHS clock selected as PLL clock entry.
 *            RCC_PLLSource_USBSS(625MHz) - USBSS clock selected as PLL clock entry.
 *            RCC_PLLSource_PLLHS(480M-625MHz-357MHz-125MHz) - PLLHS clock selected
 *        as PLL clock entry.
 *          RCC_PLLDiv - specifies the PLL Division factor.
 *            This parameter can be RCC_PLLDiv_x where x:[2,16].
 *          Should close PLLGATE before use this function
 *
 * @return  none
 */
void RCC_PLLConfig(uint32_t RCC_PLLSource, uint32_t RCC_PLLDiv)
{
    uint32_t tmpreg = 0;

