openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_rcc.c
    tmpreg = RCC->CFGR0;
    tmpreg &= ~((3<<21) | (0xF<<17));
    tmpreg |= RCC_PLLSource | RCC_PLLDiv;

    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_PLLHSConfig
 *
 * @brief   Configures the PLLHS clock source a.
 *
 * @param   RCC_PLLSource - specifies the PLL entry clock source.
 *            RCC_PLLHSSource_USBHS_480M(480MHz) - USBHS clock selected as PLL clock entry.
 *            RCC_PLLHSSource_USBSS_625M(625MHz) - USBSS 625M clock selected as PLL clock entry.
 *            RCC_PLLHSSource_USBSS_357M(357MHz) - USBSS 357M clock selected as PLL clock entry.
 *            RCC_PLLHSSource_USBSS_125M(125MHz) - USBSS 125M clock selected as PLL clock entry.
 *          Should close PLLGATE before use this function
 *          Tips: RCC_PLLHSSource_USBSS_625M - only applicable to chips with a batch number greater than zero in the fifth digit.
 *
 * @return  none
 */
void RCC_PLLHSConfig(uint32_t RCC_PLLHSSource)
{
    uint32_t tmpreg = 0;
    tmpreg = RCC->CFGR0;
    tmpreg &= ~(3<<21);
    tmpreg |= RCC_PLLHSSource;
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_PLLGATECmd
 *
 * @brief   ENABLE or DISABLE PLL clock  gate.
 *          
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PLLGATECmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR &= ~(1 << 31);
    }
    else
    {
        RCC->CTLR |= (1 << 31);
    }
}

/*********************************************************************
 * @fn      RCC_SYSCLKConfig
 *
 * @brief   Configures the system clock (SYSCLK).
 *
 * @param   RCC_SYSCLKSource - specifies the clock source used as system clock.
 *            RCC_SYSCLKSource_HSI - HSI selected as system clock.
 *            RCC_SYSCLKSource_HSE - HSE selected as system clock.
 *            RCC_SYSCLKSource_PLLCLK - PLL selected as system clock.
 *
 * @return  none
 */
void RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSource)
{
    uint32_t tmpreg = 0;

    tmpreg = RCC->CFGR0;
    tmpreg &= CFGR0_SW_Mask;
    tmpreg |= RCC_SYSCLKSource;
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_GetSYSCLKSource
 *
 * @brief   Returns the clock source used as system clock.
 *
 * @return  0x00 - HSI used as system clock.
 *          0x04 - HSE used as system clock.
 *          0x08 - PLL used as system clock.
 */
uint8_t RCC_GetSYSCLKSource(void)
{
    return ((uint8_t)(RCC->CFGR0 & CFGR0_SWS_Mask));
}

/*********************************************************************
 * @fn      RCC_CoreCLKConfig
 *
 * @brief   Configures the Core clock.
 *
 * @param   RCC_SYSCLK_Div - defines the HB clock divider. This clock is derived from
 *        the system clock (SYSCLK).
 *            RCC_SYSCLK_Div1 - Core clock = SYSCLK.
 *            RCC_SYSCLK_Div2 - Core clock = SYSCLK/2.
 *            RCC_SYSCLK_Div4 - Core clock = SYSCLK/4.
 *            RCC_SYSCLK_Div8 - Core clock = SYSCLK/8.
 *            RCC_SYSCLK_Div16 - Core clock = SYSCLK/16.
 *            RCC_SYSCLK_Div64 - Core clock = SYSCLK/64.
 *            RCC_SYSCLK_Div128 - Core clock = SYSCLK/128.
 *            RCC_SYSCLK_Div256 - Core clock = SYSCLK/256.
 *            RCC_SYSCLK_Div512 - Core clock = SYSCLK/512.
 *
 * @return  none
 */
void RCC_CoreCLKConfig(uint32_t RCC_SYSCLK_Div)
{
    uint32_t tmpreg = 0;

    tmpreg = RCC->CFGR0;
    tmpreg &= CFGR0_HPRE_Reset_Mask;
    tmpreg |= RCC_SYSCLK_Div;
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_HCLKConfig
 *
 * @brief   Configures the HB clock (HCLK).
 *
 * @param   RCC_CoreCLK_Div - defines the Core clock divider. This clock is derived from
 *        the Core clock.
 *            RCC_CoreCLK_Div1 - HB clock = CoreCLK.
 *            RCC_CoreCLK_Div2 - HB clock = SYSCoreCLK/2.
 *
 * @return  none
 */
void RCC_HCLKConfig(uint32_t RCC_CoreCLK_Div)
{
    uint32_t tmpreg = 0;

    tmpreg = RCC->CFGR0;
    tmpreg &= ~(1<<8);
    tmpreg |= RCC_CoreCLK_Div;
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_ITConfig
 *
 * @brief   Enables or disables the specified RCC interrupts.
 *
 * @param   RCC_IT - specifies the RCC interrupt sources to be enabled or disabled.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_ITConfig(uint8_t RCC_IT, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        *(__IO uint8_t *)INTR_BYTE2_ADDRESS |= RCC_IT;
    }
    else
    {
        *(__IO uint8_t *)INTR_BYTE2_ADDRESS &= (uint8_t)~RCC_IT;
    }
}

/*********************************************************************
 * @fn      RCC_ADCCLKConfig
 *
 * @brief   Configures the ADC clock (ADCCLK).
 *
 * @param   RCC_ADCPR - This clock is derived fromthe ADC clock . 
 *            RCC_ADCPRE_Div2 - ADC clock/2.
 *            RCC_ADCPRE_Div4 - ADC clock/4.
 *            RCC_ADCPRE_Div6 - ADC clock/6.
 *            RCC_ADCPRE_Div8 - ADC clock/8.
 *          RCC_PPR2 - This clock is derived fromthe ADC clock .
 *            RCC_PPRE2_Div1 - ADC clock/1.
 *            RCC_PPRE2_Div2 - ADC clock/2.
 *            RCC_PPRE2_Div4 - ADC clock/4.
 *            RCC_PPRE2_Div8 - ADC clock/8.
 *            RCC_PPRE2_Div16 - ADC clock/16.

 *
 * @return  none
 */
void RCC_ADCCLKConfig(uint32_t RCC_ADCPR, uint32_t RCC_PPR2)
{
    uint32_t tmpreg = 0;

    tmpreg = RCC->CFGR0;
    tmpreg &= ~(0x1F << 11);   
    tmpreg |= RCC_ADCPR | RCC_PPR2;
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_LSICmd
 *
 * @brief   Enables or disables the Internal Low Speed oscillator (LSI).
 *          Note-
 *          LSI can not be disabled if the IWDG is running.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_LSICmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->RSTSCKR |= (1 << 0);
    }
    else
    {
        RCC->RSTSCKR &= ~(1 << 0);
    }
}

/*********************************************************************
 * @fn      RCC_GetClocksFreq
 *
 * @brief   The result of this function could be not correct when using
 *        fractional value for HSE crystal.
 *
 * @param   RCC_Clocks - pointer to a RCC_ClocksTypeDef structure which will hold
 *        the clocks frequencies.
 *
 * @return  none
 */
void RCC_GetClocksFreq(RCC_ClocksTypeDef *RCC_Clocks)
{
    uint32_t tmp = 0,tmp1 = 0, tmp2 = 0, presc = 0, presc1 = 0;

