openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_rcc.c
    tmp = RCC->CFGR0 & CFGR0_SWS_Mask;
    tmp1 = RCC->CFGR0 & RCC_PLLSRC;

    switch(tmp)
    {
        case 0x00:
            RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
            break;

        case 0x04:
            RCC_Clocks->SYSCLK_Frequency = HSE_VALUE;
            break;

        case 0x08:
            switch(tmp1)
            { 
                case RCC_PLLSRC_USBHSPLL_480M:
                    presc = ((RCC->CFGR0 & PLLDIV_Mask)>>17);
                    RCC_Clocks->SYSCLK_Frequency = 480000000/PLLDIV[presc];
                    break;
                case RCC_PLLSRC_USBSSPLL_625M:
                    presc = ((RCC->CFGR0 & PLLDIV_Mask)>>17);                
                    RCC_Clocks->SYSCLK_Frequency = 625000000/PLLDIV[presc];
                    break;
              case RCC_PLLSRC_HS:
              case RCC_PLLSRC_HS_1:
                    tmp = RCC->CFGR0 & PLLHS_SRC_Mask;
                    switch(tmp)
                    {
                        case RCC_PLLHS_SRC_USBSSPLL_125M:
                            RCC_Clocks->SYSCLK_Frequency = 125000000;
                            break;
                        case RCC_PLLHS_SRC_USBSSPLL_357M:    
                            RCC_Clocks->SYSCLK_Frequency = 357000000;
                            break;
                        case RCC_PLLHS_SRC_USBSSPLL_625M:    
                            RCC_Clocks->SYSCLK_Frequency = 625000000;
                            break; 
                        case RCC_PLLHS_SRC_USBHSPLL_480M:    
                            RCC_Clocks->SYSCLK_Frequency = 480000000;
                            break; 
                        default:
                            RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
                            break;                                   
                    }
                    break;    

                default:
                    RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
                    break;
            }  
            break;
        default:
            RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
            break;
    }
    
    tmp = (RCC->CFGR0 & CFGR0_HPRE_Set_Mask) >> 4;
    presc1 = HPrescTable[tmp];
    RCC_Clocks->Core_Frequency = RCC_Clocks->SYSCLK_Frequency >> presc1;

    tmp = (RCC->CFGR0 & CFGR0_FPRE_Set_Mask) >> 8;
    RCC_Clocks->HCLK_Frequency = RCC_Clocks->Core_Frequency >> tmp;
 
    tmp = RCC->CFGR2 & CFGR2_ADCSRC_Set_Mask;
    tmp1 = RCC->CFGR2 & CFGR2_ADCPLLSRC_Set_Mask;

    if((tmp == CFGR2_ADCSRC_Set_Mask))
    {
        presc = (RCC->CFGR2 & CFGR2_ADCCLKDIV_Set_Mask) >> 28;
        if(tmp1 == CFGR2_ADCPLLSRC_Set_Mask)
        {  
            tmp2 = 625000000/ADCCLKDIV[presc];
        }
        else 
        {
            tmp2 = 480000000/ADCCLKDIV[presc];
        } 
    }
    else
    {
        tmp2 = RCC_Clocks->HCLK_Frequency;
    }

    tmp = (RCC->CFGR0 & CFGR0_PPRE2_Set_Mask) >> 11;
    tmp1 = (RCC->CFGR0 & CFGR0_ADCPRE_Set_Mask) >> 14;
    RCC_Clocks->ADCCLK_Frequency = tmp2 /ADCPrescTable[tmp1]/PPrescTable[tmp];    
}

/*********************************************************************
 * @fn      RCC_HBPeriphClockCmd
 *
 * @brief   Enables or disables the HB peripheral clock.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to gates its clock.
 *            RCC_HBPeriph_DMA1.
 *            RCC_HBPeriph_CRC.
 *            RCC_HBPeriph_USBHS
 *            RCC_HBPeriph_USBPD 
 *            RCC_HBPeriph_ARGB
 *            RCC_HBPeriph_USBSS
 *          Note-
 *          SRAM clock can be disabled only during sleep mode.
 *          NewState: ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HBPeriphClockCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HBPCENR |= RCC_HBPeriph;
    }
    else
    {
        RCC->HBPCENR &= ~RCC_HBPeriph;
    }
}

/*********************************************************************
 * @fn      RCC_HB2PeriphClockCmd
 *
 * @brief   Enables or disables the High Speed HB (HB2) peripheral clock.
 *
 * @param   RCC_HB2Periph - specifies the HB2 peripheral to gates its clock.
 *            RCC_HB2Periph_AFIO.
 *            RCC_HB2Periph_GPIOA.
 *            RCC_HB2Periph_GPIOB.
 *            RCC_HB2Periph_GPIOC.
 *            RCC_HB2Periph_GPIOD.
 *            RCC_HB2Periph_ADC1.
 *            RCC_HB2Periph_ADC2
 *            RCC_HB2Periph_TIM1.
 *            RCC_HB2Periph_SPI1.
 *            RCC_HB2Periph_USART1.
 *            RCC_HB2Periph_ADC3
 *            RCC_HB2Periph_ADC4
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_HB2PeriphClockCmd(uint32_t RCC_HB2Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HB2PCENR|= RCC_HB2Periph;
    }
    else
    {
         RCC->HB2PCENR &= ~RCC_HB2Periph;
    }
}

/*********************************************************************
 * @fn      RCC_HB1PeriphClockCmd
 *
 * @brief   Enables or disables the Low Speed HB (HB1) peripheral clock.
 *
 * @param   RCC_HB1Periph - specifies the HB1 peripheral to gates its clock.
 *            RCC_HB1Periph_TIM2.
 *            RCC_HB1Periph_TIM3.
 *            RCC_HB1Periph_TIM4.
 *            RCC_HB1Periph_WWDG.
 *            RCC_HB1Periph_SPI2.
 *            RCC_HB1Periph_SPI3.
 *            RCC_HB1Periph_USART2.
 *            RCC_HB1Periph_USART3.
 *            RCC_HB1Periph_USART4
 *            RCC_HB1Periph_I2C1.
 *            RCC_HB1Periph_I2C2.
 *            RCC_HB1Periph_PWR.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HB1PeriphClockCmd(uint32_t RCC_HB1Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
         RCC->HB1PCENR |= RCC_HB1Periph;
    }
    else
    {
         RCC->HB1PCENR &= ~RCC_HB1Periph;
    }
}

/*********************************************************************
 * @fn      RCC_HB2PeriphResetCmd
 *
 * @brief   Forces or releases High Speed HB (HB2) peripheral reset.
 *
 * @param   RCC_HB2Periph - specifies the HB2 peripheral to reset.
 *            RCC_HB2Periph_AFIO.
 *            RCC_HB2Periph_GPIOA.
 *            RCC_HB2Periph_GPIOB.
 *            RCC_HB2Periph_GPIOC.
 *            RCC_HB2Periph_GPIOD.
 *            RCC_HB2Periph_ADC1.
 *            RCC_HB2Periph_ADC2
 *            RCC_HB2Periph_TIM1.
 *            RCC_HB2Periph_SPI1.
 *            RCC_HB2Periph_USART1.
 *            RCC_HB2Periph_ADC3
 *            RCC_HB2Periph_ADC4
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_HB2PeriphResetCmd(uint32_t RCC_HB2Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
         RCC->HB2PRSTR |= RCC_HB2Periph;
    }
    else
    {
         RCC->HB2PRSTR &= ~RCC_HB2Periph;
    }
}

/*********************************************************************
 * @fn      RCC_HB1PeriphResetCmd
 *
 * @brief   Forces or releases Low Speed HB (HB1) peripheral reset.
 *
 * @param   RCC_HB1Periph - specifies the HB1 peripheral to reset.
 *            RCC_HB1Periph_TIM2.
 *            RCC_HB1Periph_TIM3.
 *            RCC_HB1Periph_TIM4.
 *            RCC_HB1Periph_WWDG.
 *            RCC_HB1Periph_SPI2.
 *            RCC_HB1Periph_SPI3.
 *            RCC_HB1Periph_USART2.
 *            RCC_HB1Periph_USART3.
 *            RCC_HB1Periph_USART4
 *            RCC_HB1Periph_I2C1.
 *            RCC_HB1Periph_I2C2.
 *            RCC_HB1Periph_PWR.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HB1PeriphResetCmd(uint32_t RCC_HB1Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HB1PRSTR |= RCC_HB1Periph;
    }
    else
    {
        RCC->HB1PRSTR &= ~RCC_HB1Periph;
    }
}

/*********************************************************************
 * @fn      RCC_ClockSecuritySystemCmd
 *
 * @brief   Enables or disables the Clock Security System.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_ClockSecuritySystemCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= (1 << 19);
    }
    else
    {
        RCC->CTLR &= ~(1 << 19);
    }
}

/*********************************************************************
 * @fn      RCC_MCOConfig
 *
 * @brief   Selects the clock source to output on MCO pin.
 *
 * @param   RCC_MCO - specifies the clock source to output.
 *            RCC_MCO_NoClock - No clock selected.
 *            RCC_MCO_SYSCLK - System clock selected.
 *            RCC_MCO_HSI - HSI oscillator clock selected.
 *            RCC_MCO_HSE - HSE oscillator clock selected.
 *            RCC_MCO_PLLCLK_Div8 - PLL clock divided by 8 selected.
 *
 * @return  none
 */
void RCC_MCOConfig(uint8_t RCC_MCO)
{
    *(__IO uint8_t *)CFGR0_BYTE4_ADDRESS &= ~0xF;
    *(__IO uint8_t *)CFGR0_BYTE4_ADDRESS |= RCC_MCO;
}

/*********************************************************************
 * @fn      RCC_GetFlagStatus
 *
 * @brief   Checks whether the specified RCC flag is set or not.
 *
 * @param   RCC_FLAG - specifies the flag to check.
 *            RCC_FLAG_HSIRDY - HSI oscillator clock ready.
 *            RCC_FLAG_HSERDY - HSE oscillator clock ready.
 *            RCC_FLAG_USBHSPLLRDY - USBHS PLL clock ready.
 *            RCC_FLAG_USBSSPLLRDY - USBSS PLL clock ready.
 *            RCC_FLAG_XI_STAT - XI_XO ready.
 *            RCC_FLAG_LSIRDY - LSI oscillator clock ready.
 *            RCC_FLAG_LKUPRST - Lock up reset.
 *            RCC_FLAG_ADC3AWDRST - ADC3 Watchdog reset.
 *            RCC_FLAG_ADC4AWDRST - ADC4 Watchdog reset.
 *            RCC_FLAG_USBPDRST - USBPD reset.
 *            RCC_FLAG_ADC1AWDRST - ADC1 Watchdog reset.
 *            RCC_FLAG_ADC2AWDRST - ADC2 Watchdog reset.
 *            RCC_FLAG_PINRST - Pin reset.
 *            RCC_FLAG_PORRST - POR/PDR reset.
 *            RCC_FLAG_SFTRST - Software reset.
 *            RCC_FLAG_IWDGRST - Independent Watchdog reset.
 *            RCC_FLAG_WWDGRST - Window Watchdog reset.
 *
 * @return  FlagStatus - SET or RESET.
 */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{
    uint32_t tmp = 0;
    uint32_t statusreg = 0;

    FlagStatus bitstatus = RESET;
    tmp = RCC_FLAG >> 5;

    if(tmp == 1)
    {
        statusreg = RCC->CTLR;
    }
    else
    {
        statusreg = RCC->RSTSCKR;
    }

