openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_rcc.c
    tmp = RCC_FLAG & FLAG_Mask;

    if((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearFlag
 *
 * @brief   Clears the RCC reset flags.
 *          Note-   
 *          The reset flags are: RCC_FLAG_PINRST, RCC_FLAG_PORRST, RCC_FLAG_SFTRST,
 *        RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LKUPRST,RCC_FLAG_ADC1AWDRST,
 *        RCC_FLAG_ADC2AWDRST,RCC_FLAG_ADC3AWDRST,RCC_FLAG_ADC4AWDRST;  
 *  
 * @return  none
 */
void RCC_ClearFlag(void)
{
    RCC->RSTSCKR |= RSTSCKR_RMVF_Set;
    __NOP();
}

/*********************************************************************
 * @fn      RCC_GetITStatus
 *
 * @brief   Checks whether the specified RCC interrupt has occurred or not.
 *
 * @param   RCC_IT - specifies the RCC interrupt source to check.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_CSSF - Clock Security System interrupt. 
 *
 * @return  ITStatus - SET or RESET.
 */

ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{
    ITStatus bitstatus = RESET;

    if((RCC->INTR & RCC_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearITPendingBit
 *
 * @brief   Clears the RCC's interrupt pending bits.
 *
 * @param   RCC_IT - specifies the interrupt pending bit to clear.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_CSSF - Clock Security System interrupt.
 *
 * @return  none
 */
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{
    *(__IO uint8_t *)INTR_BYTE3_ADDRESS = RCC_IT;
}

/*********************************************************************
 * @fn      RCC_HBPeriphResetCmd
 *
 * @brief   Forces or releases HB peripheral reset.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to reset.
 *            RCC_HBPeriph_USBHS
 *            RCC_HBPeriph_USBPD 
 *            RCC_HBPeriph_ARGB
 *            RCC_HBPeriph_USBSS
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HBPeriphResetCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HBRSTR |= RCC_HBPeriph;
    }
    else
    {
        RCC->HBRSTR &= ~RCC_HBPeriph;
    }
}

/*********************************************************************
 * @fn      RCC_ADCCLKSourceConfig
 *
 * @brief   Configures the ADC clock source.
 *
 * @param   RCC_ADCCLKSource - specifies the RNG clock source.
 *            RCC_ADCCLKSource_HCLK -  HCLK clock selected as ADC clock entry
 *            RCC_ADCCLKSource_USBHSPLL - USBHS PLL clock(480M) selected as ADC clock entry
 *            RCC_ADCCLKSource_USBSSPLL - USBSS PLL clock(625M)  selected as ADC clock entry
 *
 * @return  none
 */
void RCC_ADCCLKSourceConfig(uint32_t RCC_ADCCLKSource)
{
    uint32_t tmp = 0;

    tmp = RCC->CFGR2;
    tmp &= ~RCC_ADCCLKSource_USBSSPLL;
    tmp |= RCC_ADCCLKSource;
    RCC->CFGR2 = tmp;
}

/*********************************************************************
 * @fn      RCC_ADCCLKDutyCycleConfig
 *
 * @brief   Configures the ADC clock high level duty cycle.
 *
 * @param   RCC_DutyCycle - high level duty cycle.
 *            RCC_DutyCycle_50 - ADC clock 50% duty cycle .
 *            RCC_DutyCycle_62_5 -ADC clock 62_5% duty cycle .
 *            RCC_DutyCycle_75 -ADC clock 75% duty cycle .
 *
 * @return  none
 */
void RCC_ADCCLKDutyCycleConfig(uint32_t RCC_DutyCycle)
{
    RCC->CFGR2 &= ~(3<<25);
    RCC->CFGR2 |= RCC_DutyCycle;
}

/*********************************************************************
 * @fn      RCC_ADCCLKSourceUSBConfig
 *
 * @brief   Configures the ADC clock (ADCCLK).
 *
 * @param   RCC_ADCPLLCLK_DIV - defines the ADC clock divider. This clock is derived from
 *        the ADCPLL clock .
 *          RCC_ADCPLLCLK_DIV1 - ADC clock = ADCPLL.
 *          RCC_ADCPLLCLK_DIV2 - ADC clock = ADCPLL/2.
 *          RCC_ADCPLLCLK_DIV3 - ADC clock = ADCPLL/3.
 *          RCC_ADCPLLCLK_DIV4 - ADC clock = ADCPLL/4.
 *          RCC_ADCPLLCLK_DIV5 - ADC clock = ADCPLL/5.
 *          RCC_ADCPLLCLK_DIV6 - ADC clock = ADCPLL/6.
 *          RCC_ADCPLLCLK_DIV7 - ADC clock = ADCPLL/7.
 *          RCC_ADCPLLCLK_DIV8 - ADC clock = ADCPLL/8.
 *          RCC_ADCPLLCLK_DIV9 - ADC clock = ADCPLL/9.
 *          RCC_ADCPLLCLK_DIV10 - ADC clock = ADCPLL/10.
 *          RCC_ADCPLLCLK_DIV11 - ADC clock = ADCPLL/11.
 *          RCC_ADCPLLCLK_DIV12 - ADC clock = ADCPLL/12.
 *          RCC_ADCPLLCLK_DIV13 - ADC clock = ADCPLL/13.
 *          RCC_ADCPLLCLK_DIV14 - ADC clock = ADCPLL/14.
 *          RCC_ADCPLLCLK_DIV15 - ADC clock = ADCPLL/15.
 *          RCC_ADCPLLCLK_DIV16 - ADC clock = ADCPLL/16.
 *
 * @return  none
 */
void RCC_ADCClockSourceUSBConfig(uint32_t RCC_ADCPLLCLK_DIV)
{
    uint32_t tmpreg = 0;
    tmpreg = RCC->CFGR2;
    tmpreg &= ~CFGR2_ADCPRE_Reset_Mask;
    tmpreg |= RCC_ADCPLLCLK_DIV;
    RCC->CFGR2 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_USBHS_PLLCmd
 *
 * @brief   ENABLE or DISABLE USBHS PLL Clock.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_USBHS_PLLCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= RCC_USBHSPLLON;
    }
    else
    {
        RCC->CTLR &= ~RCC_USBHSPLLON;
    }
}

/*********************************************************************
 * @fn      RCC_USBSS_PLLCmd
 *
 * @brief   ENABLE or DISABLE USBSS PLL Clock.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_USBSS_PLLCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= RCC_USBSSPLLON;
    }
    else
    {
        RCC->CTLR &= ~RCC_USBSSPLLON;
    }
}

/*********************************************************************
 * @fn      RCC_PIPEcmd
 *
 * @brief   ENABLE or DISABLE PIPE.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PIPECmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= RCC_PIPEON;
    }
    else
    {
        RCC->CTLR &= ~RCC_PIPEON;
    }
}

/*********************************************************************
 * @fn      RCC_USBHS_USBSSPLLCLKConfig
 *
 * @brief   Configures the USBHS/USBSS PLL clock source.
 *
 * @param   RCC_USBHS_USBSSPLLSource - the USBHS clock source.
 *            RCC_USBHSPLLSource_HSE - HSE clock selected as USBHS PLL clock entry
 *            RCC_USBHSPLLSource_HSI - HSI clock selected as USBHS PLL clock entry
 *            RCC_USBHSPLLSource_USBSS_Div25 - USBSS_Div25 selected as USBHS PLL clock entry
 *         RCC_USBSSPLLSource - the USBHS clock source.
 *            RCC_USBSSPLLSource_HSE - HSE clock selected as USBSS PLL clock entry
 *            RCC_USBSSPLLSource_HSI - HSI clock selected as USBSS PLL clock entry
 *            RCC_USBSSPLLSource_USBHS_Div24 - USBHS_Div24 selected as USBSS PLL clock entry
 *         note: RCC_USBHSPLLSource_USBSS_Div25 and RCC_USBSSPLLSource_USBHS_Div24 cannot be used simultaneously
 * @return  none
 */
void RCC_USBHS_USBSSPLLCLKConfig(uint32_t RCC_USBHSPLLSource, uint32_t RCC_USBSSPLLSource)
{
    if((RCC_USBHSPLLSource == RCC_USBHSPLLSource_USBSS_Div25)&&(RCC_USBSSPLLSource == RCC_USBSSPLLSource_USBHS_Div24))return;
    
    RCC->CFGR2 &= ~(0xF<<6);
    if(RCC_USBHSPLLSource == RCC_USBHSPLLSource_HSE )
    {
        RCC->CFGR2 |= RCC_USBHSPLLSource;
    }
    else if(RCC_USBHSPLLSource == RCC_USBHSPLLSource_HSI )
    {
        RCC->CFGR2 |= RCC_USBHSPLLSource;
    }
    else if(RCC_USBHSPLLSource == RCC_USBHSPLLSource_USBSS_Div25 )
    {
        RCC->CFGR2 |= RCC_USBHSPLLSource;
    }
    if(RCC_USBSSPLLSource == RCC_USBSSPLLSource_HSE)
    {
        RCC->CFGR2 |= RCC_USBSSPLLSource;
    }
    else if(RCC_USBSSPLLSource == RCC_USBSSPLLSource_HSI)
    {
        RCC->CFGR2 |= RCC_USBSSPLLSource;
    }
    else if(RCC_USBSSPLLSource == RCC_USBSSPLLSource_USBHS_Div24)
    {
        RCC->CFGR2 |= RCC_USBSSPLLSource;
    }     
}

/*********************************************************************
 * @fn      RCC_USBHSPLLReferConfig
 *
 * @brief   Configures the USBHS PLL refer clock.
 *
 * @param   RCC_USBHSPLLRefer - the USBHS PLL refer clock.
 *            RCC_USBHSPLLRefer_12M - USBHS PLL Refer clock 12M
 *            RCC_USBHSPLLRefer_20M - USBHS PLL Refer clock 20M
 *            RCC_USBHSPLLRefer_24M  - USBHS PLL Refer clock 24M
 *            RCC_USBHSPLLRefer_25M  - USBHS PLL Refer clock 25M
 *            RCC_USBHSPLLRefer_32M - USBHS PLL Refer clock 32M
 *
 * @return  none
 */
void RCC_USBHSPLLReferConfig(uint32_t RCC_USBHSPLLRefer)
{
    RCC->CFGR2 &= ~(7<<0);
    RCC->CFGR2 |= RCC_USBHSPLLRefer;
}

/*********************************************************************
 * @fn      RCC_USBSSPLLReferConfig
 *
 * @brief   Configures the USBSS PLL refer clock.
 *
 * @param   RCC_USBSSPLLRefer - the USBSS PLL refer clock.
 *            RCC_USBSSPLLRefer_20M - USBSS PLL Refer clock 20M
 *            RCC_USBSSPLLRefer_24M - USBSS PLL Refer clock 24M
 *            RCC_USBSSPLLRefer_25M - USBSS PLL Refer clock 25M
 *            RCC_USBSSPLLRefer_30M - USBSS PLL Refer clock 30M
 *            RCC_USBSSPLLRefer_32M - USBSS PLL Refer clock 32M
 *            RCC_USBSSPLLRefer_40M - USBSS PLL Refer clock 40M
 *            RCC_USBSSPLLRefer_60M - USBSS PLL Refer clock 60M
 *            RCC_USBSSPLLRefer_80M - USBSS PLL Refer clock 80M
 *
 * @return  none
 */

void RCC_USBSSPLLReferConfig(uint32_t RCC_USBSSPLLRefer)
{
    RCC->CFGR2 &= ~(7<<3);
    RCC->CFGR2 |= RCC_USBSSPLLRefer;
}

/*********************************************************************
 * @fn      RCC_UTMICmd
 *
 * @brief   ENABLE or DISABLE UTMI.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_UTMICmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CFGR0 |= RCC_UTMION;
    }
    else
    {
        RCC->CFGR0 &= ~RCC_UTMION;
    }
}

/*********************************************************************
 * @fn      RCC_LPMCmd
 *
 * @brief   ENABLE or DISABLE PLM clock gate.
 *          
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_LPMCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR &= ~(1 << 8);
    }
    else
    {
        RCC->CTLR |= (1 << 8);
    }
}

/*********************************************************************
 * @fn      RCC_HSERDY_TimeConfig
 *
 * @brief   Configures the time of HSE ready.
 *
 * @param   RCC_HSERDY_Time_Mode - the time mode of HSE ready.
 *            RCC_HSERDY_Time_Mode0 - the time mode0 of HSE ready.
 *            RCC_HSERDY_Time_Mode1 - the time mode1 of HSE ready.
 *            RCC_HSERDY_Time_Mode2 - the time mode2 of HSE ready.
 *            RCC_HSERDY_Time_Mode3 - the time mode3 of HSE ready.
 *            
 * @return  none
 */
void RCC_HSERDY_TimeConfig(uint32_t RCC_HSERDY_Time_Mode)
{
    RCC->CFGR2 &= ~(3<<16);
    RCC->CFGR2 |= (RCC_HSERDY_Time_Mode << 16);
}

/*********************************************************************
 * @fn      RCC_USBHSRDY_TimeConfig
 *
 * @brief   Configures the time of USBHS PLL ready.
 *
 * @param   RCC_USBHSRDY_Time_Mode - the time mode of USBHS PLL ready.
 *            RCC_USBHSRDY_Time_Mode0 - the time mode0 of USBHS PLL ready.
 *            RCC_USBHSRDY_Time_Mode1 - the time mode1 of USBHS PLL ready.
 *            RCC_USBHSRDY_Time_Mode2 - the time mode2 of USBHS PLL ready.
 *            RCC_USBHSRDY_Time_Mode3 - the time mode3 of USBHS PLL ready.
 *            
 * @return  none
 */
void RCC_USBHSRDY_TimeConfig(uint32_t RCC_USBHSRDY_Time_Mode)
{
    RCC->CFGR2 &= ~(3<<18);
    RCC->CFGR2 |= (RCC_USBHSRDY_Time_Mode << 18);
}

/*********************************************************************
 * @fn      RCC_USBSSRDY_TimeConfig
 *
 * @brief   Configures the time of USBSS PLL ready.
 *
 * @param   RCC_USBSSRDY_Time_Mode - the time mode of USBSS PLL ready.
 *            RCC_USBSSRDY_Time_Mode0 - the time mode0 of USBSS PLL ready.
 *            RCC_USBSSRDY_Time_Mode1 - the time mode1 of USBSS PLL ready.
 *            RCC_USBSSRDY_Time_Mode2 - the time mode2 of USBSS PLL ready.
 *            RCC_USBSSRDY_Time_Mode3 - the time mode3 of USBSS PLL ready.
 *            
 * @return  none
 */
void RCC_USBSSRDY_TimeConfig(uint32_t RCC_USBSSRDY_Time_Mode)
{
    RCC->CFGR2 &= ~(3<<20);
    RCC->CFGR2 |= (RCC_USBSSRDY_Time_Mode << 20);
}